In [1]:
import pandas as pd
import numpy as np
import re
import os

In [2]:
naver_df = pd.read_csv('../../naver_crw/DAOU/test_large_out_v3.csv', index_col=0, encoding='euc-kr')

In [4]:
print(naver_df.info())
naver_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6664 entries, 0 to 6663
Data columns (total 27 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   사업장명                    6664 non-null   object
 1   업소유형                    874 non-null    object
 2   업태구분명                   6664 non-null   object
 3   지번주소                    6653 non-null   object
 4   도로명주소                   3986 non-null   object
 5   가까운 지하철역                5774 non-null   object
 6   지하철역과의 거리               6664 non-null   float64
 7   도보시간                    6664 non-null   float64
 8   위도                      5774 non-null   float64
 9   경도                      5774 non-null   float64
 10  별점                      310 non-null    float64
 11  방문자 리뷰수                 685 non-null    object
 12  블로그 리뷰수                 513 non-null    object
 13  한실수                     5434 non-null   float64
 14  양실수                     5347 non-null   float64
 15  욕실수                     4813 non-null   float64
 16  구비시설                    107 non-null    object
 17  네이버 이런점이 좋아요 총합         191 non-null    float64
 18  네이버 이런점이 좋아요 {항목:좋아요수}  191 non-null    object
 19  데이터갱신일자                 6664 non-null   object
 20  인허가일자                   6664 non-null   object
 21  인허가취소일자                 0 non-null      float64
 22  영업상태코드                  6664 non-null   int64
 23  폐업일자                    4173 non-null   object
 24  휴업시작일자                  0 non-null      float64
 25  휴업종료일자                  0 non-null      float64
 26  재개업일자                   0 non-null      float64
dtypes: float64(13), int64(1), object(13)
memory usage: 1.4+ MB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 6664 entries, 0 to 6663
Data columns (total 27 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   사업장명                    6664 non-null   object
 1   업소유형                    874 non-null    object
 2   업태구분명                   6664 non-null   object
 3   지번주소                    6653 non-null   object
 4   도로명주소                   3986 non-null   object
 5   가까운 지하철역                5774 non-null   object
 6   지하철역과의 거리               6664 non-null   float64
 7   도보시간                    6664 non-null   float64
 8   위도                      5774 non-null   float64
 9   경도                      5774 non-null   float64
 10  별점                      310 non-null    float64
 11  방문자 리뷰수                 685 non-null    object
 12  블로그 리뷰수                 513 non-null    object
 13  한실수                     5434 non-null   float64
 14  양실수                     5347 non-null   float64
 15  욕실수                     4813 non-null   float64
 16  구비시설                    107 non-null    object
 17  네이버 이런점이 좋아요 총합         191 non-null    float64
 18  네이버 이런점이 좋아요 {항목:좋아요수}  191 non-null    object
 19  데이터갱신일자                 6664 non-null   object
 20  인허가일자                   6664 non-null   object
 21  인허가취소일자                 0 non-null      float64
 22  영업상태코드                  6664 non-null   int64
 23  폐업일자                    4173 non-null   object
 24  휴업시작일자                  0 non-null      float64
 25  휴업종료일자                  0 non-null      float64
 26  재개업일자                   0 non-null      float64
dtypes: float64(13), int64(1), object(13)
memory usage: 1.4+ MB

In [24]:
# 사업장명 중복 제거
df_temp1 = naver_df.groupby('사업장명')['도로명주소'].count().reset_index(name='호실개수')
print(df_temp1[df_temp1.호실개수 >= 2])

            사업장명  호실개수
33    (주)케이스타 호텔     2
151          J모텔     3
152        K(케이)     2
174          M모텔     6
175          M호텔     2
...          ...   ...
4591        휴 모텔     2
4592         휴모텔     5
4611           힐     2
4613        힐링모텔     2
4614         힐모텔     3

[395 rows x 2 columns]

In [5]:
yanolja_df = pd.read_excel('../DABA/middle3.xlsx')
yanolja_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1215 entries, 0 to 1214
Data columns (total 34 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   이름                     1215 non-null   object
 1   종류                     1215 non-null   object
 2   평점                     1215 non-null   float64
 3   숙박가격                   1215 non-null   int64
 4   도보시간                   1215 non-null   object
 5   인기테그                   1215 non-null   object
 6   별점 높은순 후기              1215 non-null   object
 7   별점 낮은순 후기              1207 non-null   object
 8   주소                     1215 non-null   object
 9   객실수                    1197 non-null   object
 10  총후기                    1215 non-null   int64
 11  대실가격                   837 non-null    object
 12  대실시간                   815 non-null    object
 13  위도                     1215 non-null   float64
 14  경도                     1215 non-null   float64
 15  경쟁업소_수(1km내)           1215 non-null   int64
 16  경쟁업소_최단거리(1km내)        1204 non-null   float64
 17  경쟁업소_최장거리(1km내)        1202 non-null   float64
 18  경쟁업소_평균거리(1km내)        1202 non-null   float64
 19  버스정류장_수(1km내)          1215 non-null   int64
 20  지하철역_수(1km내)           1215 non-null   int64
 21  버스정류장_최단거리(1km내)       1138 non-null   float64
 22  버스정류장_평균거리(1km내)       1138 non-null   float64
 23  지하철역_최단거리(1km내)        1138 non-null   float64
 24  지하철역_평균거리(1km내)        1138 non-null   float64
 25  교통유동인구_월평균승차수(1km내)    1215 non-null   float64
 26  교통유동인구_월평균하차수(1km내)    1215 non-null   float64
 27  교통유동인구_월평균승하차총계(1km내)  1215 non-null   float64
 28  관광지_수(1km내)            1215 non-null   int64
 29  쇼핑몰_수(1km내)            1215 non-null   int64
 30  관광지_최단거리(1km내)         1144 non-null   float64
 31  관광지_평균거리(1km내)         1144 non-null   float64
 32  쇼핑몰_최단거리(1km내)         1144 non-null   float64
 33  쇼핑몰_평균거리(1km내)         1144 non-null   float64
dtypes: float64(17), int64(7), object(10)
memory usage: 322.9+ KB

In [8]:
print(len(yanolja_df[yanolja_df['위도'].isin(naver_df['위도'])])) # '1148' 개 ㅋ 
print(len(yanolja_df[~yanolja_df['위도'].isin(naver_df['위도'])])) # '1148' 개 ㅋ 
print(len(yanolja_df[yanolja_df['경도'].isin(naver_df['경도'])])) # '1148' 개 ㅋ 
print(len(yanolja_df[~yanolja_df['경도'].isin(naver_df['경도'])])) # '1148' 개 ㅋ

1144
71
1144
71

In [17]:
# remove 위도, 경도 없는거 제거
yanolja_df2 = yanolja_df[~yanolja_df['경도'].isin(naver_df['경도'])==False]

In [19]:
# remove 위도, 경도 없는거 제거
yanolja_df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1144 entries, 0 to 1213
Data columns (total 34 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   이름                     1144 non-null   object
 1   종류                     1144 non-null   object
 2   평점                     1144 non-null   float64
 3   숙박가격                   1144 non-null   int64
 4   도보시간                   1144 non-null   object
 5   인기테그                   1144 non-null   object
 6   별점 높은순 후기              1144 non-null   object
 7   별점 낮은순 후기              1136 non-null   object
 8   주소                     1144 non-null   object
 9   객실수                    1137 non-null   object
 10  총후기                    1144 non-null   int64
 11  대실가격                   808 non-null    object
 12  대실시간                   788 non-null    object
 13  위도                     1144 non-null   float64
 14  경도                     1144 non-null   float64
 15  경쟁업소_수(1km내)           1144 non-null   int64
 16  경쟁업소_최단거리(1km내)        1133 non-null   float64
 17  경쟁업소_최장거리(1km내)        1132 non-null   float64
 18  경쟁업소_평균거리(1km내)        1132 non-null   float64
 19  버스정류장_수(1km내)          1144 non-null   int64
 20  지하철역_수(1km내)           1144 non-null   int64
 21  버스정류장_최단거리(1km내)       1070 non-null   float64
 22  버스정류장_평균거리(1km내)       1070 non-null   float64
 23  지하철역_최단거리(1km내)        1070 non-null   float64
 24  지하철역_평균거리(1km내)        1070 non-null   float64
 25  교통유동인구_월평균승차수(1km내)    1144 non-null   float64
 26  교통유동인구_월평균하차수(1km내)    1144 non-null   float64
 27  교통유동인구_월평균승하차총계(1km내)  1144 non-null   float64
 28  관광지_수(1km내)            1144 non-null   int64
 29  쇼핑몰_수(1km내)            1144 non-null   int64
 30  관광지_최단거리(1km내)         1078 non-null   float64
 31  관광지_평균거리(1km내)         1078 non-null   float64
 32  쇼핑몰_최단거리(1km내)         1078 non-null   float64
 33  쇼핑몰_평균거리(1km내)         1078 non-null   float64
dtypes: float64(17), int64(7), object(10)
memory usage: 312.8+ KB

In [22]:
yanolja_df2.to_csv('../DABA/middle3_1144.csv', index=False, encoding='euc-kr')

In [23]:
df_temp = ynolja_df2.groupby('이름')['주소'].count().reset_index(name='호실개수')
df_temp[df_temp.호실개수 >= 2]

                    이름  호실개수
28            가산 마인드호텔     2
32            강남 648호텔     2
83            구로 JS 호텔     2
194            독산 SI호텔     2
553           신천 상주 호텔     2
565   신천(잠실새내) 호텔 더 캐슬     2
838            잠실 코너호텔     2
1006           합정 써클호텔     2
1084        홍대 나인브릭 호텔     2